import subprocess
from random import randint
import time

# https://copypastas.ru/image/   website where you can do ascii art


def make_random_text():
    list_text = [
        "Crede firmiter et pecca fortiter )",
        "Хорошего дня тебе солнце!)",
        "Мучений с проектом!",
        "C++ and Python in my heart )",
        "Не бойся одиночества. Ты всегда один",
        "Ебануться, это Arch linux!!!",
        "Точно кодить хочешь? Может в кс?)"
    ]
    return list_text[randint(0, len(list_text)-1)]
    #return list_text[6]

lambda_icons = ['''
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀#######⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀#######⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠙####⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹####⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈#####⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾######⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾#######⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰#####⢻####⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⣴####⡿⠁⠀⢿####⡆⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢀⣾####⠟⠀⠀⠀⠈#####⡄⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢠#####⠋⠀⠀⠀⠀⠀⠘####⣷⡀⠀⠀⠀⡀⠀⠀
⠀⠀⠀⠀⣰####⡿⠃⠀⠀⠀⠀⠀⠀⠀⠹####⣷⣶##⣷⠀⠀
⠀⠀⠀⣼####⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻########⡆⠀
⠀⠀⠚⠛⠛⠛⠛⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿#⡿⠿⠛⠋⠉⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀\n''',
'''
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣴⣶⣶⣦⣤⣤⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣄⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⣠⣾⣿⣿⣿⠟⠛⠉⠁⠀⠀⠀⠀⠈⠈⠛⠿⣿⣿⣿⣷⣄⠀⠀⠀⠀
⠀⠀⢀⣾⣿⣿⡿⠋⠁⠀⠐⣶⣶⣶⣶⣆⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣷⡀⠀⠀
⠀⠀⣾⣿⣿⠟⠁⠀⠀⠀⠀⠿⠿⢿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣷⡄⠀
⠀⣼⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⢈⣿⣿⣿⡂⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⣧⠀
⠠⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⡀
⠠⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⡿⢻⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⡇
⠐⣿⣿⣿⠀⠀⠀⠀⠀⠀⣸⣿⣿⡟⠀⠈⣿⣿⣿⡦⠀⠀⠀⠀⠀⢀⣿⣿⣿⠁
⠀⢿⣿⣿⣇⠀⠀⠀⢀⣾⣿⣿⠏⠀⠀⠀⠈⣿⣿⣿⣤⣴⣆⠀⠀⣼⣿⣿⡟⠀
⠀⠐⢿⣿⣿⣦⠀⢠⣾⣿⣿⠇⠀⠀⠀⠀⠀⠘⣿⣿⣿⡿⠿⠀⣴⣿⣿⡿⠁⠀
⠀⠀⠈⢻⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠁⢀⣠⣾⣿⣿⡿⠁⠀⠀
⠀⠀⠀⠀⠙⢿⣿⣿⣿⣶⣄⣀⠀⠀⠀⠀⠀⢀⣀⣤⣴⣿⣿⣿⡿⠋⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠋⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠛⠟⠟⠿⠿⠻⠛⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀
                             \n''']


#---------------- don't change please) --------------
# Оранжевый цвет
orange_color = "\033[38;5;214m"  # ANSI код для оранжевого цвета
reset_color = "\033[0m"  # Сброс цвета

lambda_icon = lambda_icons[randint(0, len(lambda_icons)-1)]
dop_text = dop_text = "\033[1;36m\033[3m" + make_random_text() + "\033[0m\n\n"

time.sleep(6)

subprocess.run(["kitty", "-e", "fish", "-c", f"cd ~; echo '{orange_color}{lambda_icon}{reset_color}{dop_text}'; exec fish"])
#               терминал        фиш   открываем началью директорию,       _текст_                           оставляем открытым
